{
  "format": "layers-model",
  "generatedBy": "keras v3.8.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.8.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Functional",
      "config": {
        "name": "multi_output_cnn",
        "trainable": true,
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batchInputShape": [null, 128, 128, 3],
              "dtype": "float32",
              "sparse": false,
              "name": "input_layer"
            },
            "name": "input_layer",
            "inbound_nodes": []
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_15",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": {
                "module": "keras.regularizers",
                "class_name": "L2",
                "config": {
                  "l2": 0.01
                },
                "registered_name": null
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d_15",
            "inbound_nodes": [[["input_layer", 0, 0, {}]]]
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_15",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            },
            "name": "max_pooling2d_15",
            "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_19",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            },
            "name": "batch_normalization_19",
            "inbound_nodes": [[["max_pooling2d_15", 0, 0, {}]]]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_19",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "rate": 0.2,
              "seed": null,
              "noise_shape": null
            },
            "name": "dropout_19",
            "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_16",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "filters": 128,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": {
                "module": "keras.regularizers",
                "class_name": "L2",
                "config": {
                  "l2": 0.01
                },
                "registered_name": null
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d_16",
            "inbound_nodes": [[["dropout_19", 0, 0, {}]]]
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_16",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            },
            "name": "max_pooling2d_16",
            "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_20",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            },
            "name": "batch_normalization_20",
            "inbound_nodes": [[["max_pooling2d_16", 0, 0, {}]]]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_20",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "rate": 0.3,
              "seed": null,
              "noise_shape": null
            },
            "name": "dropout_20",
            "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_17",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "filters": 256,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": {
                "module": "keras.regularizers",
                "class_name": "L2",
                "config": {
                  "l2": 0.01
                },
                "registered_name": null
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d_17",
            "inbound_nodes": [[["dropout_20", 0, 0, {}]]]
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_17",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            },
            "name": "max_pooling2d_17",
            "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_21",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            },
            "name": "batch_normalization_21",
            "inbound_nodes": [[["max_pooling2d_17", 0, 0, {}]]]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_21",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "rate": 0.3,
              "seed": null,
              "noise_shape": null
            },
            "name": "dropout_21",
            "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_18",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "filters": 512,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": {
                "module": "keras.regularizers",
                "class_name": "L2",
                "config": {
                  "l2": 0.01
                },
                "registered_name": null
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d_18",
            "inbound_nodes": [[["dropout_21", 0, 0, {}]]]
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_18",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            },
            "name": "max_pooling2d_18",
            "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_22",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            },
            "name": "batch_normalization_22",
            "inbound_nodes": [[["max_pooling2d_18", 0, 0, {}]]]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_22",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "rate": 0.4,
              "seed": null,
              "noise_shape": null
            },
            "name": "dropout_22",
            "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_19",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "filters": 1024,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": {
                "module": "keras.regularizers",
                "class_name": "L2",
                "config": {
                  "l2": 0.01
                },
                "registered_name": null
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d_19",
            "inbound_nodes": [[["dropout_22", 0, 0, {}]]]
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_19",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            },
            "name": "max_pooling2d_19",
            "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_23",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            },
            "name": "batch_normalization_23",
            "inbound_nodes": [[["max_pooling2d_19", 0, 0, {}]]]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_23",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "rate": 0.5,
              "seed": null,
              "noise_shape": null
            },
            "name": "dropout_23",
            "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten_3",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "data_format": "channels_last"
            },
            "name": "flatten_3",
            "inbound_nodes": [[["dropout_23", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 32,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": {
                "module": "keras.regularizers",
                "class_name": "L2",
                "config": {
                  "l2": 0.01
                },
                "registered_name": null
              },
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_4",
            "inbound_nodes": [[["flatten_3", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_24",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            },
            "name": "batch_normalization_24",
            "inbound_nodes": [[["dense_4", 0, 0, {}]]]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_24",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "rate": 0.5,
              "seed": null,
              "noise_shape": null
            },
            "name": "dropout_24",
            "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "jenis_output",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 3,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "jenis_output",
            "inbound_nodes": [[["dropout_24", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "tingkat_output",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 3,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "tingkat_output",
            "inbound_nodes": [[["dropout_24", 0, 0, {}]]]
          }
        ],
        "input_layers": [["input_layer", 0, 0]],
        "output_layers": [["jenis_output", 0, 0], ["tingkat_output", 0, 0]]
      }
    },
    "training_config": {
      "loss": {
        "jenis_output": {
          "class_name": "CategoricalCrossentropy",
          "config": {
            "name": "categorical_crossentropy",
            "reduction": "sum_over_batch_size",
            "from_logits": false,
            "label_smoothing": 0.1,
            "axis": -1
          }
        },
        "tingkat_output": {
          "class_name": "CategoricalCrossentropy",
          "config": {
            "name": "categorical_crossentropy",
            "reduction": "sum_over_batch_size",
            "from_logits": false,
            "label_smoothing": 0.1,
            "axis": -1
          }
        }
      },
      "loss_weights": null,
      "metrics": {
        "jenis_output": ["accuracy"],
        "tingkat_output": ["accuracy"]
      },
      "weighted_metrics": null,
      "run_eagerly": false,
      "steps_per_execution": 1,
      "jit_compile": true,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "adam",
          "learning_rate": 4.000000444648322e-06,
          "weight_decay": null,
          "clipnorm": null,
          "global_clipnorm": null,
          "clipvalue": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "loss_scale_factor": null,
          "gradient_accumulation_steps": null,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-07,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of7.bin",
        "group1-shard2of7.bin",
        "group1-shard3of7.bin",
        "group1-shard4of7.bin",
        "group1-shard5of7.bin",
        "group1-shard6of7.bin",
        "group1-shard7of7.bin"
      ],
      "weights": [
        {"name": "batch_normalization_19/gamma", "shape": [64], "dtype": "float32"},
        {"name": "batch_normalization_19/beta", "shape": [64], "dtype": "float32"},
        {"name": "batch_normalization_19/moving_mean", "shape": [64], "dtype": "float32"},
        {"name": "batch_normalization_19/moving_variance", "shape": [64], "dtype": "float32"},
        {"name": "batch_normalization_20/gamma", "shape": [128], "dtype": "float32"},
        {"name": "batch_normalization_20/beta", "shape": [128], "dtype": "float32"},
        {"name": "batch_normalization_20/moving_mean", "shape": [128], "dtype": "float32"},
        {"name": "batch_normalization_20/moving_variance", "shape": [128], "dtype": "float32"},
        {"name": "batch_normalization_21/gamma", "shape": [256], "dtype": "float32"},
        {"name": "batch_normalization_21/beta", "shape": [256], "dtype": "float32"},
        {"name": "batch_normalization_21/moving_mean", "shape": [256], "dtype": "float32"},
        {"name": "batch_normalization_21/moving_variance", "shape": [256], "dtype": "float32"},
        {"name": "batch_normalization_22/gamma", "shape": [512], "dtype": "float32"},
        {"name": "batch_normalization_22/beta", "shape": [512], "dtype": "float32"},
        {"name": "batch_normalization_22/moving_mean", "shape": [512], "dtype": "float32"},
        {"name": "batch_normalization_22/moving_variance", "shape": [512], "dtype": "float32"},
        {"name": "batch_normalization_23/gamma", "shape": [1024], "dtype": "float32"},
        {"name": "batch_normalization_23/beta", "shape": [1024], "dtype": "float32"},
        {"name": "batch_normalization_23/moving_mean", "shape": [1024], "dtype": "float32"},
        {"name": "batch_normalization_23/moving_variance", "shape": [1024], "dtype": "float32"},
        {"name": "batch_normalization_24/gamma", "shape": [32], "dtype": "float32"},
        {"name": "batch_normalization_24/beta", "shape": [32], "dtype": "float32"},
        {"name": "batch_normalization_24/moving_mean", "shape": [32], "dtype": "float32"},
        {"name": "batch_normalization_24/moving_variance", "shape": [32], "dtype": "float32"},
        {"name": "conv2d_15/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"},
        {"name": "conv2d_15/bias", "shape": [64], "dtype": "float32"},
        {"name": "conv2d_16/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"},
        {"name": "conv2d_16/bias", "shape": [128], "dtype": "float32"},
        {"name": "conv2d_17/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"},
        {"name": "conv2d_17/bias", "shape": [256], "dtype": "float32"},
        {"name": "conv2d_18/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"},
        {"name": "conv2d_18/bias", "shape": [512], "dtype": "float32"},
        {"name": "conv2d_19/kernel", "shape": [3, 3, 512, 1024], "dtype": "float32"},
        {"name": "conv2d_19/bias", "shape": [1024], "dtype": "float32"},
        {"name": "dense_4/kernel", "shape": [16384, 32], "dtype": "float32"},
        {"name": "dense_4/bias", "shape": [32], "dtype": "float32"},
        {"name": "jenis_output/kernel", "shape": [32, 3], "dtype": "float32"},
        {"name": "jenis_output/bias", "shape": [3], "dtype": "float32"},
        {"name": "tingkat_output/kernel", "shape": [32, 3], "dtype": "float32"},
        {"name": "tingkat_output/bias", "shape": [3], "dtype": "float32"}
      ]
    }
  ]
}